In [1]:
import numpy as np
import pandas as pd

In [2]:
inventory = pd.read_csv('inventory.csv',delimiter= ';')  
actor = pd.read_csv('actor.csv',delimiter= ';')
old_HDD = pd.read_csv('old_HDD.csv',delimiter= ';') 
film = pd.read_csv('film.csv',delimiter= ';')  
category = pd.read_csv('category.csv',delimiter= ';') 
language = pd.read_csv('language.csv',delimiter= ';') 
rental = pd.read_csv('rental.csv',delimiter= ';')

# Actor Table

In [3]:
actor = pd.read_csv('actor.csv',delimiter= ';')
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [4]:
actor.drop_duplicates(inplace=True)
actor.isnull().sum()

actor_id       0
first_name     0
last_name      0
last_update    0
dtype: int64

In [5]:
actor.duplicated().sum()

0

In [6]:
actor.head()

   actor_id first_name     last_name    last_update
0         1   PENELOPE       GUINESS  15/2/06 04:34
1         2       NICK      WAHLBERG  15/2/06 04:34
2         3         ED         CHASE  15/2/06 04:34
3         4   JENNIFER         DAVIS  15/2/06 04:34
4         5     JOHNNY  LOLLOBRIGIDA  15/2/06 04:34

In [7]:
actor['full_name'] = actor['first_name'] + ' ' + actor['last_name']

In [8]:
actor.drop(columns = 'first_name', inplace = True)
actor.drop(columns = 'last_name', inplace = True)
actor.drop(columns = 'last_update', inplace= True)

In [9]:
actor

     actor_id            full_name
0           1     PENELOPE GUINESS
1           2        NICK WAHLBERG
2           3             ED CHASE
3           4       JENNIFER DAVIS
4           5  JOHNNY LOLLOBRIGIDA
..        ...                  ...
195       196          BELA WALKEN
196       197           REESE WEST
197       198          MARY KEITEL
198       199        JULIA FAWCETT
199       200         THORA TEMPLE

[200 rows x 2 columns]

In [10]:
actor.to_csv('actor_clean.csv', index=False)

# Category Table

In [11]:
category

    category_id         name    last_update
0             1       Action  15/2/06 04:46
1             2    Animation  15/2/06 04:46
2             3     Children  15/2/06 04:46
3             4     Classics  15/2/06 04:46
4             5       Comedy  15/2/06 04:46
5             6  Documentary  15/2/06 04:46
6             7        Drama  15/2/06 04:46
7             8       Family  15/2/06 04:46
8             9      Foreign  15/2/06 04:46
9            10        Games  15/2/06 04:46
10           11       Horror  15/2/06 04:46
11           12        Music  15/2/06 04:46
12           13          New  15/2/06 04:46
13           14       Sci-Fi  15/2/06 04:46
14           15       Sports  15/2/06 04:46
15           16       Travel  15/2/06 04:46

In [12]:
new_row = {'category_id': '0', 'name': 'Unknown', 'last_update': '-'}
category = category.append(new_row, ignore_index=True)
category

/var/folders/9r/gs1g10c57dq76y5t067393s40000gn/T/ipykernel_18203/835959458.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  category = category.append(new_row, ignore_index=True)

   category_id         name    last_update
0            1       Action  15/2/06 04:46
1            2    Animation  15/2/06 04:46
2            3     Children  15/2/06 04:46
3            4     Classics  15/2/06 04:46
4            5       Comedy  15/2/06 04:46
5            6  Documentary  15/2/06 04:46
6            7        Drama  15/2/06 04:46
7            8       Family  15/2/06 04:46
8            9      Foreign  15/2/06 04:46
9           10        Games  15/2/06 04:46
10          11       Horror  15/2/06 04:46
11          12        Music  15/2/06 04:46
12          13          New  15/2/06 04:46
13          14       Sci-Fi  15/2/06 04:46
14          15       Sports  15/2/06 04:46
15          16       Travel  15/2/06 04:46
16           0      Unknown              -

In [13]:
category.drop(columns='last_update',inplace= True)
category

   category_id         name
0            1       Action
1            2    Animation
2            3     Children
3            4     Classics
4            5       Comedy
5            6  Documentary
6            7        Drama
7            8       Family
8            9      Foreign
9           10        Games
10          11       Horror
11          12        Music
12          13          New
13          14       Sci-Fi
14          15       Sports
15          16       Travel
16           0      Unknown

# old_HDD Table

In [14]:
old_HDD = pd.read_csv('old_HDD.csv',delimiter= ';')

In [15]:
old_HDD

    first_name last_name                  title  release_year  category_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

[1000 rows x 5 columns]

In [16]:
old_HDD.duplicated().sum()

0

In [17]:
old_HDD.isnull().sum()

first_name      0
last_name       0
title           0
release_year    0
category_id     0
dtype: int64

In [18]:
old_HDD = pd.merge(old_HDD, film, on='title', how='right')
old_HDD.isnull().sum()

first_name               386
last_name                386
title                      0
release_year_x           386
category_id              386
film_id                    0
description                0
release_year_y             0
language_id                0
original_language_id    1386
rental_duration            0
rental_rate                0
length                     0
replacement_cost           0
rating                     0
special_features           0
last_update                0
dtype: int64

In [19]:
old_HDD.drop(columns='original_language_id',inplace= True)

In [20]:
old_HDD.drop(columns=['first_name', 'last_name', 'release_year_x'], inplace=True)

In [21]:
old_HDD.duplicated().sum()

386

In [22]:
old_HDD.drop_duplicates(inplace=True)

In [23]:
old_HDD.isnull().sum()

title                 0
category_id         386
film_id               0
description           0
release_year_y        0
language_id           0
rental_duration       0
rental_rate           0
length                0
replacement_cost      0
rating                0
special_features      0
last_update           0
dtype: int64

In [24]:
old_HDD

,title,category_id,film_id,description,release_year_y,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,ACADEMY DINOSAUR,6.0,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",15/2/06 05:03
4,ACE GOLDFINGER,11.0,2,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",15/2/06 05:03
5,ADAPTATION HOLES,6.0,3,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",15/2/06 05:03
8,AFFAIR PREJUDICE,NaN,4,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",15/2/06 05:03
9,AFRICAN EGG,NaN,5,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,15/2/06 05:03
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1379,YOUNG LANGUAGE,6.0,996,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",15/2/06 05:03
1381,YOUTH KICK,12.0,997,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",15/2/06 05:03
1383,ZHIVAGO CORE,11.0,998,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,NC-17,Deleted Scenes,15/2/06 05:03
1384,ZOOLANDER FICTION,NaN,999,A Fateful Reflection of a Waitress And a Boat ...,2006,1,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",15/2/06 05:03
1385,ZORRO ARK,NaN,1000,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",15/2/06 05:03

In [25]:
old_HDD.fillna(0, inplace=True)
old_HDD.isnull().sum()

title               0
category_id         0
film_id             0
description         0
release_year_y      0
language_id         0
rental_duration     0
rental_rate         0
length              0
replacement_cost    0
rating              0
special_features    0
last_update         0
dtype: int64

In [26]:
old_HDD.head(3)

,title,category_id,film_id,description,release_year_y,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,ACADEMY DINOSAUR,6.0,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",15/2/06 05:03
4,ACE GOLDFINGER,11.0,2,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",15/2/06 05:03
5,ADAPTATION HOLES,6.0,3,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",15/2/06 05:03

In [27]:
old_HDD.drop(columns='last_update', inplace=True)

In [28]:
old_HDD['category_id'] = old_HDD['category_id'].astype(int)

In [29]:
desired_order = ['film_id', 'title','category_id','release_year_y','description','language_id','rental_duration','rental_rate','length','rating','special_features','replacement_cost']
old_HDD = old_HDD.reindex(columns=desired_order)

In [30]:
film = old_HDD

In [31]:
film.rename(columns={'release_year_y': 'release_year'}, inplace=True)
film

,film_id,title,category_id,release_year,description,language_id,rental_duration,rental_rate,length,rating,special_features,replacement_cost
0,1,ACADEMY DINOSAUR,6,2006,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,PG,"Deleted Scenes,Behind the Scenes",20.99
4,2,ACE GOLDFINGER,11,2006,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,G,"Trailers,Deleted Scenes",12.99
5,3,ADAPTATION HOLES,6,2006,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,NC-17,"Trailers,Deleted Scenes",18.99
8,4,AFFAIR PREJUDICE,0,2006,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,G,"Commentaries,Behind the Scenes",26.99
9,5,AFRICAN EGG,0,2006,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,G,Deleted Scenes,22.99
...,...,...,...,...,...,...,...,...,...,...,...,...
1379,996,YOUNG LANGUAGE,6,2006,A Unbelieveable Yarn of a Boat And a Database ...,1,6,0.99,183,G,"Trailers,Behind the Scenes",9.99
1381,997,YOUTH KICK,12,2006,A Touching Drama of a Teacher And a Cat who mu...,1,4,0.99,179,NC-17,"Trailers,Behind the Scenes",14.99
1383,998,ZHIVAGO CORE,11,2006,A Fateful Yarn of a Composer And a Man who mus...,1,6,0.99,105,NC-17,Deleted Scenes,10.99
1384,999,ZOOLANDER FICTION,0,2006,A Fateful Reflection of a Waitress And a Boat ...,1,5,2.99,101,R,"Trailers,Deleted Scenes",28.99
1385,1000,ZORRO ARK,0,2006,A Intrepid Panorama of a Mad Scientist And a B...,1,3,4.99,50,NC-17,"Trailers,Commentaries,Behind the Scenes",18.99

In [32]:
old_HDD2 = pd.read_csv('old_HDD2.csv',delimiter= ';')

In [33]:
old_HDD2

    first_name last_name                  title  release_year  category_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

[1000 rows x 5 columns]

In [34]:
old_HDD2['full_name'] = old_HDD2['first_name'] + ' ' + old_HDD2['last_name']

In [35]:
old_HDD2.drop(columns='first_name', inplace=True)
old_HDD2.drop(columns='last_name', inplace=True)

In [36]:
old_HDD2

                     title  release_year  category_id         full_name
0         ACADEMY DINOSAUR          2006            6  PENELOPE GUINESS
1     ANACONDA CONFESSIONS          2006            2  PENELOPE GUINESS
2              ANGELS LIFE          2006           13  PENELOPE GUINESS
3    BULWORTH COMMANDMENTS          2006           10  PENELOPE GUINESS
4            CHEAPER CLYDE          2006           14  PENELOPE GUINESS
..                     ...           ...          ...               ...
995      COMANCHEROS ENEMY          2006            3      GOLDIE BRODY
996        DAISY MENAGERIE          2006           14      GOLDIE BRODY
997        DESERT POSEIDON          2006           11      GOLDIE BRODY
998         EVERYONE CRAFT          2006            9      GOLDIE BRODY
999         EXORCIST STING          2006           15      GOLDIE BRODY

[1000 rows x 4 columns]

In [37]:
old_HDD2 = pd.merge(old_HDD2, actor, on='full_name', how='inner')
old_HDD2 = pd.merge(old_HDD2, film, on='title', how='right')

In [38]:
old_HDD2.drop(columns=['release_year_x', 'title','full_name','category_id_x'], inplace=True)

In [82]:
old_HDD2.drop(columns=['category_id_y', 'description','language_id','rental_duration','rental_rate','length','rating','special_features','replacement_cost'], inplace=True)

In [90]:
old_HDD2 = old_HDD2.dropna()
old_HDD2 = old_HDD2.drop_duplicates()

In [91]:
old_HDD2['actor_id'] = old_HDD2['actor_id'].astype(int)

In [93]:
old_HDD2 = old_HDD2.drop(columns=['release_year_y'])

In [94]:
old_HDD2

      actor_id  film_id
0            1        1
1           10        1
2           20        1
3           30        1
4           19        2
...        ...      ...
1379         3      996
1380        27      996
1381        23      997
1382        37      997
1383        13      998

[1000 rows x 2 columns]

In [96]:
actor_movie = old_HDD2
actor_movie

      actor_id  film_id
0            1        1
1           10        1
2           20        1
3           30        1
4           19        2
...        ...      ...
1379         3      996
1380        27      996
1381        23      997
1382        37      997
1383        13      998

[1000 rows x 2 columns]

In [97]:
actor_movie.to_csv('actor_movie_clean.csv', index=False)

# Inventory Table

In [39]:
inventory

     inventory_id  film_id  store_id    last_update
0               1        1         1  15/2/06 05:09
1               2        1         1  15/2/06 05:09
2               3        1         1  15/2/06 05:09
3               4        1         1  15/2/06 05:09
4               5        1         2  15/2/06 05:09
..            ...      ...       ...            ...
995           996      222         2  15/2/06 05:09
996           997      222         2  15/2/06 05:09
997           998      222         2  15/2/06 05:09
998           999      223         2  15/2/06 05:09
999          1000      223         2  15/2/06 05:09

[1000 rows x 4 columns]

In [40]:
inventory.isnull().sum()

inventory_id    0
film_id         0
store_id        0
last_update     0
dtype: int64

In [41]:
inventory.duplicated().sum()

0

In [42]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [43]:
inventory.drop(columns='last_update', inplace=True)

In [44]:
inventory

     inventory_id  film_id  store_id
0               1        1         1
1               2        1         1
2               3        1         1
3               4        1         1
4               5        1         2
..            ...      ...       ...
995           996      222         2
996           997      222         2
997           998      222         2
998           999      223         2
999          1000      223         2

[1000 rows x 3 columns]

# Language Table

In [45]:
language = pd.read_csv('language.csv',delimiter= ';') 
language

   language_id      name    last_update
0            1   English  15/2/06 05:02
1            2   Italian  15/2/06 05:02
2            3  Japanese  15/2/06 05:02
3            4  Mandarin  15/2/06 05:02
4            5    French  15/2/06 05:02
5            6    German  15/2/06 05:02

In [46]:
language.isnull().sum()

language_id    0
name           0
last_update    0
dtype: int64

In [47]:
language.duplicated().sum()

0

In [48]:
language.drop(columns='last_update', inplace=True)

In [49]:
language

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French
5            6    German

# Rental Table

In [50]:
rental

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,24/5/05 22:53,367,130,26/5/05 22:04,1,15/2/06 21:30
1,2,24/5/05 22:54,1525,459,28/5/05 19:40,1,15/2/06 21:30
2,3,24/5/05 23:03,1711,408,1/6/05 22:12,1,15/2/06 21:30
3,4,24/5/05 23:04,2452,333,3/6/05 01:43,2,15/2/06 21:30
4,5,24/5/05 23:05,2079,222,2/6/05 04:33,1,15/2/06 21:30
...,...,...,...,...,...,...,...
995,997,31/5/05 00:08,4243,216,2/6/05 00:17,2,15/2/06 21:30
996,998,31/5/05 00:16,3395,389,1/6/05 22:41,1,15/2/06 21:30
997,999,31/5/05 00:25,4433,413,3/6/05 06:05,2,15/2/06 21:30
998,1000,31/5/05 00:25,1774,332,8/6/05 19:42,2,15/2/06 21:30
999,1001,31/5/05 00:46,1498,64,6/6/05 06:14,2,15/2/06 21:30

In [51]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

In [52]:
rental.isnull().sum()

rental_id       0
rental_date     0
inventory_id    0
customer_id     0
return_date     0
staff_id        0
last_update     0
dtype: int64

In [53]:
rental.duplicated().sum()

0

In [54]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,24/5/05 22:53,367,130,26/5/05 22:04,1,15/2/06 21:30
1,2,24/5/05 22:54,1525,459,28/5/05 19:40,1,15/2/06 21:30
2,3,24/5/05 23:03,1711,408,1/6/05 22:12,1,15/2/06 21:30
3,4,24/5/05 23:04,2452,333,3/6/05 01:43,2,15/2/06 21:30
4,5,24/5/05 23:05,2079,222,2/6/05 04:33,1,15/2/06 21:30

In [55]:
rental.drop(columns='last_update', inplace=True)

In [56]:
len(rental)

1000

In [57]:
rental.tail()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
995,997,31/5/05 00:08,4243,216,2/6/05 00:17,2
996,998,31/5/05 00:16,3395,389,1/6/05 22:41,1
997,999,31/5/05 00:25,4433,413,3/6/05 06:05,2
998,1000,31/5/05 00:25,1774,332,8/6/05 19:42,2
999,1001,31/5/05 00:46,1498,64,6/6/05 06:14,2

In [58]:
rental['rental_date'] = pd.to_datetime(rental['rental_date'], format='%d/%m/%y %H:%M')

In [59]:
rental['return_date'] = pd.to_datetime(rental['return_date'], format='%d/%m/%y %H:%M')

In [60]:
rental

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:00,367,130,2005-05-26 22:04:00,1
1,2,2005-05-24 22:54:00,1525,459,2005-05-28 19:40:00,1
2,3,2005-05-24 23:03:00,1711,408,2005-06-01 22:12:00,1
3,4,2005-05-24 23:04:00,2452,333,2005-06-03 01:43:00,2
4,5,2005-05-24 23:05:00,2079,222,2005-06-02 04:33:00,1
...,...,...,...,...,...,...
995,997,2005-05-31 00:08:00,4243,216,2005-06-02 00:17:00,2
996,998,2005-05-31 00:16:00,3395,389,2005-06-01 22:41:00,1
997,999,2005-05-31 00:25:00,4433,413,2005-06-03 06:05:00,2
998,1000,2005-05-31 00:25:00,1774,332,2005-06-08 19:42:00,2
999,1001,2005-05-31 00:46:00,1498,64,2005-06-06 06:14:00,2

# New Table: Customers

In [61]:
customer1 = rental['customer_id'].unique()

In [62]:
customer1

array([130, 459, 408, 333, 222, 549, 269, 239, 126, 399, 142, 261, 334,
       446, 319, 316, 575,  19, 456, 185, 388, 509, 438, 350,  37, 371,
       301, 232,  44, 430, 369, 230, 272, 597, 484,  88, 535, 302, 207,
       413, 174, 523, 532, 436,   7,  35, 282, 498,  18, 256, 507, 569,
       291, 131, 511,   6, 323, 470, 250, 419, 383, 368, 346,  86, 119,
       120, 305,  73, 100,  48, 391, 265, 510,   1, 451, 135, 245, 314,
       286, 427, 492, 414, 266, 331,  53, 499,  25, 267, 288, 197, 400,
        49, 263, 208, 468, 343, 384, 310, 108, 196, 317, 242, 503, 227,
       500,  93, 506, 455, 524,  51, 365, 405, 273,  43, 246, 439,  94,
        40,  23,  56, 325, 479, 237, 304, 504, 560, 586, 257, 354,  89,
       472, 297, 357,  82, 433, 274, 429,  14,  57, 348, 551, 462, 344,
       505, 290, 182, 296, 104, 151,  33, 322, 401, 469, 381, 107, 176,
       533, 552,  47, 548,  75, 587, 254, 556, 125, 515, 243, 247, 412,
       437, 270,  29, 564, 184, 546,  54,  71, 321, 444,  20, 109, 528,
       114, 345, 379, 170,  59, 394,  98,  91, 121, 309, 489, 542, 143,
        83, 460, 318, 467, 221, 571, 312,  58, 531, 566, 536, 211, 103,
       214, 543, 158, 240, 102, 545, 539, 204, 187, 416, 390, 373, 502,
       482,  21, 236, 449, 251, 303, 417, 200,  92, 193, 311, 133,  45,
       167, 582, 359, 162,  17,  81, 577,  65, 448, 387, 596, 534, 464,
       547, 375, 277, 409, 201, 594, 203, 238, 249,  60,  77,   2, 496,
       144, 292, 432, 105, 231, 248,  67, 299, 194,  16, 275, 165, 516,
       209, 378, 473,  36,   9, 118, 157, 452, 382, 198, 152, 147, 134,
       361, 508,  22, 295, 337, 306, 584, 183, 298, 213,  28, 112, 544,
       422,  46, 424, 168,  84, 220, 307, 219, 475, 150, 284, 522, 161,
       190, 574,   3, 525, 403, 293, 172,  87, 127, 529, 300, 565, 447,
       364, 442, 557, 101, 154, 159, 445,  32, 491, 398, 476,  95, 228,
       501,  64, 526, 287, 199, 145, 179, 111, 421, 434, 113, 110, 480,
       374, 138, 223, 169, 589, 514, 315, 493, 450, 106, 376,  55, 572,
       463, 324, 253, 155,  76, 588, 173, 181, 186, 386,  69, 490, 308,
       244, 538, 294, 393, 332, 590, 537, 426, 554, 494, 580, 595, 471,
       372, 407, 495, 241, 360, 428,  42, 465, 396, 281, 327, 578, 166,
       415, 313, 338, 148, 461, 411,  85, 117, 330, 252, 518, 215, 259,
         5, 363, 454, 276, 483, 420, 576, 435, 563, 146,  50, 149, 124,
       352,  72,  27, 562, 553, 593,  26, 402, 171, 235, 225, 474, 441,
       573, 217,  79, 380, 517, 530, 122, 406, 358, 328,   8,  99,  52,
       326, 339, 477,  62, 128, 349, 192, 156, 561, 486, 366, 115, 385,
       550, 137, 141,  66, 367, 210, 440, 520, 581, 279, 262,  11,  12,
       123, 513, 216, 389])

In [63]:
customer = pd.DataFrame(customer1, columns=['customer_id'])

In [64]:
customer = customer.sort_values(by='customer_id', ascending=True)

In [65]:
customer = customer.reset_index(drop=True)

In [66]:
import random
import string

# Function to generate a random name
def generate_random_name():
    letters = string.ascii_lowercase
    return ''.join(random.choice(letters).capitalize() for i in range(5))

names_list = [generate_random_name() for _ in range(485)]
print(names_list)
customer['Names']= names_list

['WYOJM', 'LDEAP', 'NMLGI', 'IYNBF', 'NXVVT', 'KOCCN', 'KTJHS', 'FHWMS', 'SUJNA', 'EAQPB', 'BKUUD', 'MHHYW', 'YDASV', 'UQQZG', 'OFURR', 'OXQJD', 'JQSYN', 'QGNTC', 'AOQYR', 'TQCGB', 'NCINU', 'RRHJU', 'QJGDD', 'NWWZA', 'JZOWW', 'ESCYQ', 'WSRTS', 'ZYRMU', 'BLTOP', 'PJTHN', 'CSJVS', 'WPVJX', 'MTIQX', 'YIBFC', 'ZSRNG', 'SHYXZ', 'DCYLO', 'HZDDP', 'OEHQH', 'PDLGN', 'QLLGT', 'HVNCW', 'FLCTY', 'VVPLA', 'GQNDF', 'QPDTO', 'UUYVK', 'QOIFD', 'BKBFQ', 'ZBEEK', 'ZISLP', 'NTDDM', 'GQNQG', 'JOCXH', 'VPOQD', 'ITKPG', 'YGSRC', 'VDAGE', 'BEBPN', 'KAVUG', 'NXTZH', 'AMNDM', 'HHRXR', 'LBGKH', 'UQYQS', 'BVFEI', 'HRUZE', 'ZUPZP', 'PGTIH', 'SHKIC', 'FQGOL', 'FGLDI', 'NYYZY', 'TQPYB', 'IYVKX', 'HKLIX', 'QDRWL', 'XSCBT', 'JOTNH', 'RRLCT', 'DKDAM', 'JXZZV', 'EOZPN', 'XFWBK', 'WTQQM', 'ZQNLJ', 'HIQIL', 'JGAMW', 'MXRCK', 'MTFHK', 'XYGVD', 'UEPPD', 'WMNYG', 'EIDVS', 'AVNDZ', 'HABOI', 'HMVRJ', 'AUMAO', 'IGSYI', 'WVQLJ', 'WNOWP', 'JBPBG', 'ZNDWO', 'IPFNK', 'KSTPT', 'HGKZL', 'TZSWE', 'VSNJB', 'VFLIQ', 'YYIVK', 'HMVAH', 'WKKLF', 'NGSLW', 'IMNUE', 'IJLYN', 'GVXIE', 'IISYW', 'TPESY', 'XIOIX', 'WGVLD', 'BYUZY', 'LYMBJ', 'RPAWC', 'JTDDQ', 'CJUYS', 'NXCSP', 'SKCXX', 'IONOM', 'LEPOC', 'JLJKY', 'VZHKC', 'XVQRL', 'THWRM', 'UIBFU', 'MRPXH', 'OHTHV', 'NUCXG', 'SRYKO', 'YGJUU', 'RVMRE', 'KKMOK', 'PZLYO', 'KDPOL', 'LXTAS', 'EKOMJ', 'WXUVA', 'WZNHW', 'ZCOPA', 'OGMRZ', 'DGCXM', 'CMKVD', 'KLDBP', 'NAPUJ', 'FVBJO', 'DLAIS', 'ZGQOO', 'WYIVH', 'HPXQP', 'FITTY', 'NVXKB', 'TCHUI', 'NPRNM', 'KQAKB', 'DJVIR', 'KEIQW', 'VAXLP', 'IUKBJ', 'ZUFUS', 'LSDYB', 'SLUDD', 'SFQTQ', 'IQNTT', 'HUDPV', 'IVXXO', 'SLWSA', 'OWVXI', 'BQJEG', 'EGYAG', 'JMILQ', 'KMBJB', 'OKBNA', 'FEFCD', 'FDZDA', 'RAATC', 'BXHIP', 'OUHYJ', 'IWIIM', 'ZVZOT', 'ICBLL', 'OLYNV', 'KEVKJ', 'LKVYU', 'QXGAE', 'EGVCA', 'WVCVR', 'GGJPZ', 'GYZFP', 'HJWWN', 'ABEWS', 'ECUKR', 'CXGAO', 'VKCBE', 'KZDWW', 'PKKWN', 'TEZIV', 'IJCOS', 'BNCEQ', 'WCMAC', 'GHQTL', 'VIJBJ', 'UWFBD', 'UNXKO', 'PSAXD', 'YSBJI', 'HVGSG', 'GIQWD', 'HMMIG', 'RZHLS', 'SNEUV', 'FZRXP', 'HFMAK', 'HFSUI', 'UUWCY', 'FLVQN', 'ZSBKR', 'CLYMT', 'XFRDD', 'WOPWA', 'XZOPY', 'KOHNW', 'ZPCEQ', 'YJGOW', 'NMAEO', 'OJFUJ', 'EDWMX', 'PRJJJ', 'XDRHA', 'CMQRO', 'SFGBF', 'YBYMA', 'ZIGZG', 'NWYUF', 'ACDIL', 'LXRLO', 'CAMQO', 'QGGUF', 'EWNSP', 'FVRCJ', 'BZQQV', 'XLUZT', 'ICJFV', 'CEBBU', 'JLGDZ', 'QTLNC', 'DDJDW', 'NFDLQ', 'XQZFJ', 'ALBRA', 'YOCNH', 'VBGJX', 'BSPIY', 'PGZJE', 'NMIWH', 'DPGBD', 'JQQGD', 'CBYTS', 'CYNWS', 'PNKOL', 'LLMQO', 'EHCUX', 'WCMBB', 'CTNUP', 'BDNWM', 'KHPML', 'RGAQK', 'BCVNH', 'YYSDS', 'EIMXG', 'GLHLU', 'VYRUP', 'SZOXG', 'WPQDE', 'JFVTU', 'YDVMD', 'HDLRL', 'LFCNB', 'ZIVKX', 'MGFIC', 'OWDUD', 'PLYNS', 'SRURD', 'SNADC', 'YVNTO', 'TRZQD', 'AOVCX', 'WZIXX', 'AAFEF', 'EOOUV', 'CFAWL', 'NXEEE', 'VWHOK', 'LOWCY', 'MFLHW', 'VOEXM', 'VKHUH', 'TPINC', 'EIOPM', 'SWJWY', 'OJUIT', 'ZKJXA', 'KPCBG', 'WDLKE', 'NFNTH', 'GAVAY', 'ENOVO', 'XCFCW', 'OYIZH', 'QXVGH', 'EMALU', 'GJWRP', 'ZFUIP', 'CTIBV', 'PNMFC', 'VWVER', 'NHIRL', 'VDBVB', 'CRDET', 'AWELR', 'UFJFE', 'JPFXM', 'RKGOK', 'VFSIZ', 'YGBPY', 'YLDTJ', 'XYPVL', 'HRCPI', 'PKKKX', 'ARUWW', 'KVFVX', 'ZCYNM', 'YGUNA', 'OTGGO', 'GMJFO', 'JMRYF', 'KQUHS', 'VQLQF', 'MFWNW', 'FBOAS', 'PPYHC', 'WDNTO', 'THQAH', 'IUGTD', 'CRVMZ', 'QGMAX', 'DPQJJ', 'EPSQU', 'ONZQG', 'GSPUD', 'GIFRO', 'CNWYK', 'EROCC', 'DFWRD', 'HFQOP', 'WIRVS', 'JTDMQ', 'SEMEA', 'XLAXC', 'WVQYD', 'AXUNH', 'EQZDU', 'JKVXJ', 'KJVKZ', 'JIORF', 'AMAIS', 'HVIOY', 'KNLMK', 'GYPWI', 'VLXXG', 'VZPHT', 'NYMNB', 'QLDJY', 'PEATB', 'FJCTQ', 'EQLQQ', 'AKEIO', 'RHGAK', 'VBOXD', 'UTFYT', 'QUZKI', 'GLGYB', 'ZWYEX', 'DMWFT', 'DRCUO', 'HLIKY', 'ZHIRF', 'KXGYJ', 'MWPYR', 'LJEAZ', 'IZVZF', 'NXXPA', 'BYLCK', 'BKGMW', 'KXQLY', 'GVGEZ', 'BGDKJ', 'BXSSI', 'OYJXP', 'BTSVG', 'XOOPO', 'XWYRU', 'UJPWL', 'GENHM', 'QISNN', 'LNTZJ', 'WEBLI', 'HFKNP', 'EZNDC', 'YIGST', 'FGYRZ', 'XNXAC', 'JCTSL', 'GAYHU', 'MYBAZ', 'HDKYG', 'PCFAK', 'VWVBS', 'RUYNX', 'NRCKH', 'FNUSI', 'EMFWR', 'MUTNO', 'EPDSZ', 'MGIMS', 'OVLAR', 'VYGJO', 'ARGBY', 'GGIKY', 'GNCHD', 'CEJYF', 'JPRRZ', 'IKWNT', 'SPUHI', 'UCFXQ', 'WNKIB', 'QRYID', 'FZBQF', 'MPFCU', 'DFTTH', 'OMMED', 'ENRDA', 'OLDCX', 'OZBZL', 'CSYVM', 'XWHZG', 'KQSEB', 'UPHKZ', 'LFFMU', 'HEZJK', 'ZJWKQ', 'YWSHA', 'QUFFV', 'FJVWY', 'SSWHM', 'ISVVK', 'YBKOT', 'UNJRX', 'BYSTX', 'ZCQKM', 'TGGTP', 'QXSIP', 'GISYB', 'BGFAZ', 'TITUF', 'KHPIX', 'ZEHDJ', 'FMEFA', 'NTZDW', 'QKWBJ', 'WKPBB', 'RXNEM', 'JSFWC', 'DDAZN', 'MWVBB', 'ALOIA', 'WOCVS']

In [67]:
customer.rename(columns={'Names': 'names'}, inplace=True)

In [68]:
customer

     customer_id  names
0              1  WYOJM
1              2  LDEAP
2              3  NMLGI
3              5  IYNBF
4              6  NXVVT
..           ...    ...
480          593  JSFWC
481          594  DDAZN
482          595  MWVBB
483          596  ALOIA
484          597  WOCVS

[485 rows x 2 columns]

In [69]:
import random

def generate_random_phone_number():
    area_code = random.randint(100, 999)
    first_part = random.randint(100, 999)
    second_part = random.randint(1000, 9999)
    return f"({area_code}) {first_part}-{second_part}"

# Generate a list of 485 phone numbers
phone_numbers = [generate_random_phone_number() for _ in range(485)]

# Display the list containing 485 phone numbers
print(phone_numbers)

['(893) 435-9194', '(638) 252-8481', '(410) 621-1276', '(266) 262-5926', '(136) 342-3708', '(822) 772-7757', '(924) 622-9281', '(112) 490-7581', '(480) 763-4883', '(426) 300-9138', '(384) 368-8466', '(408) 874-2467', '(185) 487-9690', '(200) 186-3422', '(469) 519-5414', '(622) 827-7512', '(373) 658-5038', '(638) 321-6905', '(301) 420-7789', '(798) 216-8692', '(540) 331-1410', '(841) 205-5771', '(112) 889-9916', '(242) 818-8015', '(352) 567-3455', '(172) 792-2106', '(986) 774-1164', '(846) 514-4192', '(115) 682-2880', '(591) 249-7906', '(133) 211-8508', '(262) 115-5458', '(571) 319-4934', '(464) 785-3956', '(833) 161-8292', '(988) 426-4908', '(223) 593-5809', '(365) 103-9065', '(277) 591-1533', '(711) 937-7028', '(416) 826-9290', '(173) 578-5792', '(389) 961-9685', '(178) 684-5137', '(117) 954-9867', '(245) 887-2190', '(792) 896-6125', '(421) 612-8475', '(228) 804-9245', '(571) 189-7449', '(794) 587-6476', '(500) 184-4804', '(590) 481-7736', '(794) 291-3599', '(514) 827-9038', '(396) 764-6070', '(755) 861-1106', '(147) 269-9393', '(767) 392-1764', '(579) 590-9836', '(529) 708-4051', '(661) 737-7856', '(335) 430-3300', '(694) 604-9829', '(437) 639-8814', '(715) 835-7763', '(787) 285-8975', '(423) 310-1561', '(741) 426-9795', '(763) 655-8620', '(804) 769-2616', '(707) 130-7420', '(838) 494-3801', '(580) 309-5389', '(941) 904-7727', '(653) 825-4569', '(853) 593-3226', '(432) 806-3374', '(277) 145-7004', '(329) 468-8384', '(634) 766-2753', '(560) 505-4191', '(926) 614-7147', '(905) 571-4312', '(617) 673-3598', '(595) 844-1910', '(219) 709-1919', '(587) 117-4115', '(829) 935-4602', '(452) 781-2826', '(499) 314-9446', '(329) 681-5113', '(536) 460-7254', '(775) 266-2812', '(643) 452-2535', '(605) 819-6490', '(271) 512-2282', '(426) 664-9644', '(915) 391-1466', '(680) 609-6609', '(558) 223-1308', '(541) 663-7659', '(350) 237-4388', '(838) 757-9224', '(903) 632-2223', '(938) 777-5391', '(370) 776-3109', '(143) 658-3163', '(900) 725-6192', '(939) 121-3834', '(149) 630-2550', '(954) 967-8932', '(479) 749-5573', '(329) 743-6790', '(364) 852-5746', '(796) 187-1262', '(837) 427-1377', '(237) 910-1677', '(993) 975-5246', '(850) 174-1525', '(439) 790-5405', '(138) 580-3657', '(118) 144-1159', '(831) 504-9436', '(987) 474-2549', '(398) 602-8050', '(981) 379-5987', '(169) 562-2532', '(389) 250-5867', '(253) 710-4183', '(539) 368-4855', '(613) 103-3762', '(139) 472-8639', '(125) 951-8474', '(906) 394-3017', '(152) 554-2923', '(704) 574-9681', '(115) 741-2926', '(677) 916-7694', '(718) 301-6828', '(939) 231-5266', '(696) 452-6501', '(632) 514-7470', '(727) 482-3410', '(419) 647-9675', '(145) 341-5523', '(595) 832-3073', '(296) 229-7953', '(113) 332-3702', '(619) 546-5119', '(143) 467-7022', '(675) 623-2570', '(266) 803-8436', '(914) 991-2246', '(253) 547-9017', '(224) 241-7613', '(742) 407-8076', '(735) 936-7645', '(420) 673-5358', '(592) 662-1086', '(860) 906-1468', '(846) 615-4823', '(837) 907-1134', '(554) 166-8314', '(137) 415-5651', '(579) 561-1719', '(338) 831-8930', '(893) 128-2426', '(234) 496-5409', '(204) 672-3806', '(669) 973-7155', '(301) 114-8449', '(461) 270-9623', '(153) 235-2882', '(119) 124-8945', '(557) 259-4218', '(298) 425-1086', '(620) 158-4494', '(191) 729-1207', '(529) 165-8302', '(920) 774-9808', '(621) 777-5254', '(193) 945-8819', '(521) 333-6109', '(310) 983-5173', '(915) 249-6729', '(102) 964-9193', '(232) 642-2061', '(619) 955-9597', '(437) 116-5945', '(249) 592-6587', '(303) 528-6754', '(548) 726-1463', '(204) 898-2532', '(685) 856-1009', '(167) 353-5442', '(166) 116-8299', '(164) 359-3425', '(712) 726-7226', '(884) 635-5337', '(268) 820-9375', '(588) 484-5501', '(419) 163-6289', '(677) 244-9544', '(779) 108-1580', '(754) 219-1628', '(939) 756-2993', '(503) 360-9296', '(806) 850-9154', '(427) 135-1617', '(909) 842-4277', '(424) 143-8394', '(111) 304-6235', '(358) 208-4866', '(989) 307-7953', '(805) 795-9139', '(801) 670-7934', '(425) 271-6274', '(239) 872-8356', '(635) 167-9575', '(920) 383-8606', '(481) 281-2313', '(260) 967-2389', '(667) 224-4860', '(611) 152-9757', '(898) 866-1133', '(854) 764-7776', '(218) 541-5684', '(515) 216-7518', '(494) 804-1223', '(193) 683-3539', '(717) 105-8145', '(141) 961-8420', '(303) 705-9586', '(452) 461-2047', '(387) 309-2534', '(337) 729-5829', '(149) 572-3787', '(240) 991-3311', '(447) 722-1568', '(724) 915-3308', '(797) 206-4188', '(358) 607-1444', '(920) 720-8296', '(475) 720-5695', '(907) 926-9889', '(799) 527-1344', '(527) 399-9864', '(621) 902-9234', '(914) 309-4746', '(478) 692-8640', '(902) 342-3908', '(142) 449-8782', '(501) 238-5008', '(157) 890-8212', '(150) 446-1615', '(474) 126-3194', '(237) 563-3331', '(532) 224-3456', '(644) 789-2710', '(870) 956-3697', '(135) 106-7110', '(301) 598-2954', '(777) 636-2204', '(941) 214-4920', '(209) 458-8002', '(192) 933-5242', '(708) 527-1434', '(378) 933-3433', '(651) 383-2850', '(612) 290-2815', '(192) 126-8331', '(730) 312-5569', '(575) 444-6234', '(928) 270-9457', '(258) 396-7593', '(378) 113-6189', '(916) 488-5941', '(616) 618-9624', '(296) 590-9954', '(372) 993-2128', '(330) 673-7223', '(924) 691-4595', '(880) 849-6837', '(284) 515-1637', '(973) 950-8104', '(144) 771-9842', '(272) 552-4957', '(837) 877-5004', '(751) 846-4162', '(818) 606-1034', '(759) 841-8280', '(595) 370-2921', '(575) 108-4763', '(516) 553-5931', '(188) 956-4119', '(718) 243-4876', '(394) 422-8015', '(965) 505-8107', '(128) 309-2880', '(861) 910-7998', '(442) 615-8969', '(536) 475-1905', '(111) 611-5048', '(563) 415-6367', '(164) 244-5510', '(731) 484-6209', '(408) 659-6649', '(509) 928-4219', '(569) 867-3936', '(518) 287-6183', '(215) 171-4691', '(777) 950-8779', '(867) 163-8481', '(540) 344-7018', '(775) 276-5025', '(554) 428-8565', '(139) 796-3632', '(865) 773-5347', '(482) 672-1223', '(474) 830-6394', '(691) 889-2235', '(667) 989-4796', '(527) 151-5514', '(419) 125-8774', '(835) 569-2689', '(678) 227-5164', '(910) 619-8886', '(352) 516-7313', '(719) 352-5327', '(465) 738-1121', '(414) 656-5470', '(241) 451-9891', '(606) 874-5634', '(536) 935-4599', '(871) 927-9252', '(125) 164-6419', '(850) 491-7300', '(907) 501-9775', '(484) 933-3131', '(803) 315-4629', '(348) 788-5264', '(255) 669-5756', '(244) 476-1713', '(641) 305-1131', '(414) 501-2953', '(454) 277-6446', '(144) 576-1995', '(181) 346-2398', '(143) 156-5005', '(199) 450-7241', '(794) 787-2714', '(504) 132-3553', '(935) 506-2359', '(479) 733-5767', '(545) 914-7385', '(225) 266-4712', '(932) 379-3203', '(240) 737-3753', '(300) 932-6014', '(448) 854-6730', '(811) 763-6307', '(838) 412-6397', '(566) 213-5168', '(440) 749-9314', '(962) 323-1828', '(569) 205-1512', '(526) 751-6958', '(254) 558-1164', '(146) 968-5580', '(379) 724-4938', '(940) 697-1696', '(678) 100-3792', '(119) 158-8335', '(197) 970-4124', '(954) 496-9215', '(511) 890-4174', '(577) 544-3703', '(533) 209-7984', '(294) 546-6955', '(624) 636-1429', '(229) 507-5351', '(494) 959-8000', '(669) 162-8568', '(490) 790-8351', '(702) 944-9725', '(919) 831-6410', '(745) 246-7714', '(849) 626-1843', '(234) 364-3510', '(202) 426-4192', '(904) 637-2091', '(605) 895-6489', '(468) 900-6691', '(753) 301-2583', '(273) 732-1955', '(134) 443-2913', '(777) 410-2705', '(337) 372-9342', '(394) 782-1155', '(377) 376-8583', '(868) 167-7511', '(852) 467-4650', '(307) 937-4795', '(581) 654-4634', '(372) 655-7046', '(412) 553-4145', '(269) 913-2872', '(486) 679-2314', '(314) 245-3500', '(413) 534-2128', '(548) 829-9425', '(803) 151-1258', '(489) 381-4858', '(233) 497-5386', '(823) 410-7696', '(905) 388-2307', '(662) 819-5948', '(209) 782-2162', '(842) 461-1751', '(930) 610-3214', '(258) 526-2143', '(446) 539-5254', '(949) 116-5324', '(583) 932-3167', '(229) 800-4102', '(776) 810-2122', '(857) 386-3731', '(982) 692-3555', '(208) 441-7223', '(511) 137-5613', '(754) 213-8787', '(207) 415-1956', '(826) 989-2194', '(235) 695-4776', '(893) 555-3914', '(229) 218-4061', '(497) 727-8480', '(385) 476-2393', '(781) 105-3994', '(263) 418-2077', '(808) 399-4428', '(222) 229-3995', '(375) 380-5494', '(405) 321-7752', '(903) 855-3185', '(744) 289-5317', '(801) 136-5979', '(482) 994-6974', '(353) 163-5146', '(254) 237-9959', '(331) 154-6874', '(833) 106-6028', '(699) 815-9332', '(671) 671-2522', '(574) 646-1403', '(851) 254-8988', '(968) 123-9835', '(185) 260-1760', '(722) 100-4521', '(540) 810-3638', '(718) 833-5005', '(770) 860-2996', '(759) 787-6130', '(151) 960-9693', '(276) 202-7715', '(607) 757-4373', '(104) 493-7967', '(977) 323-3241', '(142) 538-1914', '(269) 866-4911', '(925) 735-3155', '(819) 662-4221', '(761) 997-9714', '(272) 637-9823', '(609) 684-7011', '(320) 263-2369', '(854) 635-5448', '(376) 579-6167', '(363) 878-3184', '(744) 168-1048', '(288) 798-9085', '(776) 564-2771', '(757) 494-6937', '(715) 438-9274']

In [70]:
customer['phone_number']= phone_numbers

In [71]:
customer

     customer_id  names    phone_number
0              1  WYOJM  (893) 435-9194
1              2  LDEAP  (638) 252-8481
2              3  NMLGI  (410) 621-1276
3              5  IYNBF  (266) 262-5926
4              6  NXVVT  (136) 342-3708
..           ...    ...             ...
480          593  JSFWC  (744) 168-1048
481          594  DDAZN  (288) 798-9085
482          595  MWVBB  (776) 564-2771
483          596  ALOIA  (757) 494-6937
484          597  WOCVS  (715) 438-9274

[485 rows x 3 columns]

# New table: Staff

In [72]:
staff = rental['staff_id'].unique()

In [73]:
staff = pd.DataFrame(staff, columns=['staff_id'])

In [74]:
staff

   staff_id
0         1
1         2

In [75]:
staff['names']= ['Lorraine Sanchez', 'Christopher Perez']

In [76]:
staff

   staff_id              names
0         1   Lorraine Sanchez
1         2  Christopher Perez

In [77]:
staff

   staff_id              names
0         1   Lorraine Sanchez
1         2  Christopher Perez

In [ ]:
inventory.to_csv('inventory_clean.csv', index=False)
actor.to_csv('actor_clean.csv', index=False)
film.to_csv('film_clean.csv', index=False)
category.to_csv('category_clean.csv', index=False)
language.to_csv('language_clean.csv', index=False)
customer.to_csv('customer_clean.csv',index= False)
staff.to_csv('staff_clean.csv',index= False)

In [ ]:
rental_inventory_ids = set(rental['inventory_id'])
inventory_inventory_ids = set(inventory['inventory_id'])

# Identify the inventory_id values in rental that are not in inventory
invalid_inventory_ids = rental_inventory_ids - inventory_inventory_ids

# Delete rows with invalid inventory_id values from the rental DataFrame
rental = rental[~rental['inventory_id'].isin(invalid_inventory_ids)]

In [ ]:
rental.to_csv('rental_clean.csv', index=False)